module
Delayed
class
PerformableMethod
<
Struct
.
new
(
:
object,
method,
args
)
CLASS_STRING_FORMAT
=
[
A-Z
]
\w\
+
$/
AR_STRING_FORMAT
\
\d+
def
initialize
raise
NoMethodError,
"
undefined
method
`#
{
}
'
for
#
self
inspect
unless
object
respond_to?
dump
map
|a|
a
to_sym
end
display_name
case
when
then
$1
##
else
perform
load
send
*
rescue
ActiveRecord
RecordNotFound
We
cannot
do
anything
about
objects
which
were
deleted
in
the
true
private
arg
constantize
find
$2
Class
class_to_string
Base
ar_to_string
obj
AR
id
CLASS
name
Module
as_load_path
if
==
Object
||
Kernel
elsif
is_a?
parent
?
split
collect
word
underscore
/
require
amalgalite
Sequel
adapters/shared/sqlite
Top
level
holding
all
modules
and
classes
Amalgalite
Type
conversion
s
use
of
Amalgamite
SequelTypeMap
methods_handling_sql_types
delete
string
merge!
datetime
=>
%w
timestamp
,
time
float
double
real
precision
decimal
numeric
money
Return
blobs
as
instances
SQL
Blob
instead
blob
types
BigDecimal
Float
datetime_class
database_to_application_timestamp
Don
t
an
error
value
is
declared
type
doesn
match
known
type,
just
return
source
String
&&
declared_type
meth
downcase
meth,
super
Database
SQLite
databases
used
with
driver
include
DatabaseMethods
set_adapter_scheme
Mimic
file
//
uri,
by
having
2
preceding
slashes
specify
relative
path,
3
absolute
path
uri_to_options
uri
nodoc
database
host
nil?
nil
private_class_method
Connect
to
Since
based
database,
only
options
available
are
timeout,
how
long
wait
be
it
locked,
given
milliseconds
default
5000
connect
server
opts
server_opts
memory
blank_object?
db
fetch
50
without
separate
installation
database_type
sqlite
instance
Dataset
dataset
self,
Run
arguments
Returns
execute_ddl
sql,
opts=
_execute
|conn|
log_yield
sql
conn
execute_batch
number
changed
rows
execute_dui
;
last
inserted
row
execute_insert
yield
each
execute
begin
stmt
prepare
ensure
close
first
single_value
Yield
connection
Rescue
any
Errors
turn
them
into
DatabaseErrors
synchronize
Error,
SQLite3
Error
e
raise_error
The
adapter
does
not
need
pool
convert
exceptions
Also,
force
max
connections
1
being
used,
otherwise
gets
connection_pool_default_options
o
dup
Default
single
because
will
get
max_connections
@opts
Both
main
that
raises
database_error_classes
Disconnect
from
disconnect_connection
c
datasets
DatasetMethods
hash
fetch_rows
|stmt|
@columns
cols
|c|
output_identifier
col_count
size
|result|
times
|i|
i
result
Quote
using
literal_string
v
quote
File
expand_path
__FILE__
If
you
have
gems
listed
there,
including
ve
limited
test,
development,
or
production
Bundler
default,
Rails
env
defined?
SampleApp
Application
Settings
take
precedence
over
those
specified
here
configuration
should
go
files
config/initializers
--
rb
directory
automatically
loaded
Custom
directories
want
autoloadable
config
+=
%W
root
Only
plugins
named
here,
order
alphabetical
can
placeholder
explicitly
Activate
observers
always
running
active_record
Set
Time
zone
make
Active
Record
this
rake
-D
list
tasks
finding
names
UTC
time_zone
Central
US
&
Canada
locale
en
translations
rb,yml
auto
i18n
load_path
Dir
join
my
to_s
default_locale
de
JavaScript
defaults
application
js
included
action_view
jquery
rails
Configure
encoding
templates
Ruby
9
utf-8
sensitive
parameters
filtered
log
filter_parameters
password
Nokogiri
LibXML
FFI
ManagedStruct
layout
dummy,
int,
0
avoid
@layout
warnings
release
ptr
xsltFreeStylesheet
---------------------
section
Methods
set
created
This
methods
change
behavior
identifier
input
@@identifier_input_method
output
@@identifier_output_method
Whether
identifiers
columns
tables
@@quote_identifiers
call
on
going
identifier_input_method
See
identifier_input_method=
coming
identifier_output_method
identifier_output_method=
Sets
quote_identifiers
mode
quote_identifiers=
schema
use,
generally
attr_accessor
default_schema
@identifier_input_method
identifier_input_method_default
reset_schema_utility_dataset
@identifier_output_method
identifier_output_method_default
@quote_identifiers
quotes
quote_identifiers?
quote_identifiers_default
apply
Should
overridden
subclasses
fold
unquoted
lower
uppercase,
such
MySQL,
PostgreSQL,
upcase
write
custom
formatters
handle
arbitrary
passed
+describe+
To
see
action,
stand
project
say
bin/spec
-r
-f
FilteredFormatter
You
examples
groups
below
marked
show
false
group
example
describe
b
zlib
rack/request
rack/response
Rack
Paste
has
Lobster
LobsterString
Zlib
Inflate
inflate
\n
unpack
m
LambdaLobster
lambda
|env|
QUERY_STRING
include?
flip
lobster
|line|
line
ljust
42
reverse
href
?flip
content
<title>Lobstericious!</title>
<pre>
</pre>
<a
href=
length
inject
200,
Content-Type
text/html
Content-Length
req
Request
GET
left
crash
crashed
res
Response
<p><a
finish
$0
rack
Handler
WEBrick
run
ShowExceptions
Lint
Port
9292
test_helper
Test
Unit
TestCase
context
factory
setup
Sham
Name
email
rand
5
@example
com
Factory
define
user
|factory|
first_name
last_name
teardown
factories
clear
sequences
after
making
@instance
user,
Rye
support
sham
called
assert_equal
assert_match
Oracle
TEMPORARY
GLOBAL
freeze
AUTOINCREMENT
create_sequence
name,
<<
create_sequence_sql
create_trigger
create_trigger_sql
drop_sequence
drop_sequence_sql
uses
oracle
ds
tab
select
tname
filter
tabtype
TABLE
|r|
output_identifier,
r
table_exists?
count
>
auto_increment_sql
fragment
showing
table
temporary
CREATE
SEQUENCE
quote_identifier
start
||1
increment
increment_by
create_table_from_generator
generator,
drop_statement,
create_statements
create_table_sql_list
drop_statement
|sql|
options=
statements
create_table_sql
drop_seq_statement
generator
auto_increment
sequence_name
||=
seq_#
_#
trigger_name
BI_#
trigger_definition
<<-end_sql
BEGIN
IF
NEW
IS
NULL
THEN
SELECT
nextval
INTO
FROM
END
IF;
END;
end_sql
trigger_definition,
events
insert
drop_seq_statement,
table,
definition,
Array
insert,
update,
CREATE#
OR
REPLACE
replace
TRIGGER
AFTER
BEFORE
|e|
ON
quote_schema_table
AS
FOR
EACH
ROW
definition
DROP
SELECT_CLAUSE_METHODS
clause_methods
select,
distinct
where
compounds
limit
EXCEPT,
EXCEPT
ALL
except
dataset,
Hash
supported
minus,
empty?
dual
exists
associated
sequence,
most
recently
sequence
with_sql
literal
currval
to_i
requires
standard
datetimes
requires_sql_standard_datetimes?
Create
copy
calling
clone
INTERSECT
supports
timezones
timestamps
supports_timestamp_timezones?
window
functions
supports_window_functions?
aliasing
It
so
disables
cases
expression,
aliaz
expression
strftime
format
TIMESTAMP
%Y-%m-%d
%H
%M
%z
Use
colon
offset,
since
appears
hour,
minute
sprintf
doubling
inside
strings
gsub
select_clause_methods
Modify
add
clause
dummy
DUAL
source_list
offset
select_limit_sql
raw_sql_
ROWNUM
raw_rnum_
WHERE
<=
test/spec
stringio
rack/rewindable_input
rewindable
IO
@rio
RewindableInput
@io
able
read
equal
hello
world
h
length,
buffer
1,
object_id
nil,
rewind
beginning
array
|data|
data
Tempfile
no
been
yet
instance_variable_get
@rewindable_io
tempfile
tempfile2
underlying
upon
#close
closed
buffered
possible
multiple
already
StringIO
it_should_behave_like
instance_eval
undef
whose
Errno
ESPIPE
Postgres
CONVERTED_EXCEPTIONS
NativeException
JDBC
accessing
PostgreSQL
via
adapter/connection
allow
work
shared
code
AdapterMethods
Give
direct
creates
statement
executes
block_given?
executeQuery
createStatement
@db
specific
getting
values
next
access
Add
primary_keys
primary_key_sequences
variables,
we
correct
extended
@primary_keys
@primary_key_sequences
opts=nil
INSERT
primary
key
record
type=>
merge
Extend
setup_connection
extend
apply_connection_settings
Call
insert_result
last_insert_id
conn,
subclass
prepared
ps
PreparedStatementMethods
similar
native
postgres
post
defining
@name
@factory
mock
stubs
factory_name
returns
@options
magic
create
expects
@name,
|f|
pass
block
yielded
|y|
y
@factory,
@class
User
build
@class,
build_class
strategy
create,
default_strategy
same
attribute
added
twice
assert_raise
AttributeDefinitionError
add_attribute
static
defined
Attribute
Static
dynamic
Dynamic
&block
adding
Sequence
attr
instance_of
Proc
assert
attributes
@attribute
@proxy
proxy
add_to
Proxy
Build
right
Build,
association
overrides
Association
Ben
author,
referencing
AssociationDefinitionError
parent,
overriding
generated
@attr
@value
price
@hash
@attr,
wrong,
Bob!
AttributesFor,
@value,
lazy
flunk
override
symbol
parameter
alias
original
\1
@result
test_alias
discard
predefined
assert_nil
test
guess
User,
ArgumentError
argument_error
ending
business
Business
store
AttributesFor
attributes_for
Create,
Stub
stub
Stub,
option
global
build,
|method|
nonexistant
bogus
recognize
either
assert_nothing_raised
@parent
f
trying
non-existent
child,
child
while
Other;
Other
additional
2,
Child
assert_kind_of
nonexistent
context_in_directory_with_files
to_sentence
@pwd
pwd
@tmp_dir
dirname
tmp
FileUtils
mkdir_p
chdir
|file|
touch
rm_rf
should_require_definitions_from
definitions
find_definitions
spec
|dir|
dir,
dir
/factories
post_factory
/factories/post_factory
person_factory
/factories/person_factory
spec_helper
yaml
json
LoadError
skip_warn
serialization
plugin
Serialization
before
@c
Model
items
before_save
no_primary_key
id,
abc,
ghi
MODEL_DB
reset
setting
serializable
serialization,
yaml,
abc
def=>
sqls
=~
/INSERT
def|def,
VALUES
---
1\n
marshal,
BAhpBg==\n
|
json,
123
123\
serializing
hello\n
serialization_format
serialized_columns
serialized
marshal
x
Marshal
pack
JSON
generate
translate
accessor
set_primary_key
vals
update
23
UPDATE
SET
23\n
to_yaml
1,2,3
formats
deserialized
refreshing
deserialized_values
refresh
internal
bad
accessors
class,
they
easily
class_eval
-blah
1-blah
previous
@values
include,
begin_db_transaction
at_exit
rollback_db_transaction
/spec_helper
Spec
Mocks
klass
existing_method
original_value
@obj
http
//rubyforge
expectations
verify
should_receive
msg
rspec_verify
NoMethodError
fail
expected
message
received
MockExpectationError
incorrect
correct_arg
revert
existed
and_return
mock_value
Migration
up
add_index
users,
email,
unique
down
remove_index
rack/utils
provides
convenient
interface
response
allows
headers
cookies,
useful
OK
containing
HTML
iteratively
your
response,
but
note
until
+finish+
however
calls
+write+
Your
+call+
returning
body=
header=
@status
status
@header
Utils
HeaderHash
header
@writer
|x|
@body
@block
@length
body
to_str
|part|
part
TypeError,
iterable
required
attr_reader
status,
key,
set_cookie
domain
domain=
path=
According
RFC
dashes
N
B
cgi
spaces
expires
%a,
%S
GMT
secure
httponly
HttpOnly
===
cookie
escape
|v|
Set-Cookie
delete_cookie
value=
compact
/\A#
=/
at
redirect
target,
Location
target
204,
304
to_i,
to_hash,
to_a
For
&callback
callback
Append
NOTE
Do
mix
#write
str
bytesize
Helpers
100
>=
600;
200;
200
300;
300
400;
400
500;
500
404;
307
@status;
empty?;
201,
Headers
headers,
original_headers
content_type
content_length
cl
location
lib/recurring_event
SimpleExpression
RecurringEvent
Expression
A
@e
conditions
be_empty
rule
be_nil
become
intersect
intersected
@f
Day
in_month
@g
union
unioned
dates
range
@r
dates_in_range
Date
2000,
2001,
An
one
simple
condition
&=
points
matched
10
1970+rand
130
1+rand
12
point
should_not
2+rand
27
within
13
|d|
d
mday
n
Month
in_year
Week
its
rules
3,
4+rand
8
24
26
none
ymonth
mweek
@s
form
range_each_year
6
@h
@i
@j
@g,
@h,
@i,
4
other
neither
37
Library
xslt
exslt
globals
attach_function
pointer
LIBXML_PARSER_VERSION
LIBXML_VERSION
scan
/^
VERSION_INFO
libxml
binding
ffi
RUBY_PLATFORM
/java/
platform
jruby
RuntimeError,
JRuby
later
JRUBY_VERSION
ruby
signatures
syntax_error_handler,
pointer,
void
io_write_callback,
string,
int
io_read_callback,
io_close_callback,
hash_copier_callback,
xpath_lookup_callback,
start_document_sax_func,
start_element_sax_func,
end_element_sax_func,
characters_sax_func,
comment_sax_func,
warning_sax_func,
error_sax_func,
cdata_block_sax_func,
start_element_ns_sax2_func,
end_element_ns_sax2_func,
free,
second
assign
elsewhere
const
char
parser
tree
must
freed
xmlEncodeEntitiesReentrant,
results
let
optimize
valid
entities
xpath
these
implemented
C
macros
xmlXPathReturnNodeSet
ctx,
ns
valuePush
xmlXPathReturnTrue
ctx
xmlXPathNewBoolean
xmlXPathReturnFalse
xmlXPathReturnString
xmlXPathReturnNumber
val
xmlFree
actual
function
free
syntax_error_handler
generic_error_handler
check
null
deallocated
reader
is_2_6_16?
could
helpers
pointer_offset
byte
nth
pointers
html/document
abstract_unit
fixtures/company
fixtures
companies
errors
add_on_empty
empty\
Firm
read_inheritable_attribute
validate
Second
add_column
salt,
remove_column
salt
Fixtures
Animal
name,species
<Animal
name=#
Diff
Runner
Options
new,
@differ
Expectations
Differs
unified
diff
two
EOD
@@
foo
bar
diff_as_string
expected,
eql
expected_diff
arrays
foo,
baz,
quux
metasyntactic,
variable
delta,
charlie
width,
quite
wide
tango
very
-
diff_as_object
expected,actual
bob
giraffe
tortoise
-1,5
+1,5
name=bob,
species=tortoise
species=giraffe
diff_format
1,5
!
loading
structure
INTEGRATION_DB
instance_variable_set
@schemas,
create_table!
nodes
primary_key
foreign_key
parent_id,
Node
many_to_one
one_to_many
children,
key=>
parent_id
eager
ancestors,
eager_loader=>
proc
|eo|
Handle
node
also
non_root_nodes
eo
reject
|n|
pk
Make
sure
their
associations
id_map
Doesn
cause
loop,
left,
primary_key=>id_map
keys
sort
ancestors
|node|
Populate
Initialize
empty
children
identity
infinite
eager_loader
records
returned
Exclude
loop
exclude
id=>
descendants
Get
parent_id=>1
parent_id=>2
parent_id=>5
clear_sqls
drop_table
remove_const,
id=>1
node,
7
Extensions
find_or_create
model
author_id=>model_object
find_or_create_by_name
authors
Author
authorships,
author_id,
Authorship
author
@author
authorship
authorships_dataset
Bob
author_id
authorship2
name=>
Jim
has_many
through
has_one
belongs_to
firms
clients
invoices,
read_only=>true,
dataset=>proc
Invoice
eager_graph
client
after_load=>
invs
|inv|
inv
firm
key_hash
|firm|
invoices
firm_id
firm_id,
Client
firm,
key=>nil,
Delete
cached
invoice_client
related
eagerly
loaded,
|client|
@firm1
@firm2
@client1
@client2
@client3
@invoice1
@invoice2
@invoice3
@invoice5
clients,
sort_by
@invoice1,
@invoice2,
@firm1,
firm1,
firm2
invs1
firm1
invs2
@invoice4,
@firm2,
Associations
assets
Integer
attachable_id
attachable_type
Asset
reciprocal=>
assets,
|asset|
asset
attachable
attach
posts
Post
attachable_id,
|ds|
attachable_type=>
_add_asset
save
_remove_asset
_remove_all_assets
attachable_id=>pk,
attachable_id=>nil,
attachable_type=>nil
notes
Note
@post
@note
@asset1
@asset2
posts,
@asset1,
correctly
remove
remove_all_assets
reload
client,
client_name=>name
client_name
invoice
X
Y
client_name=>
statistics
projects
Project
class=>
Ticket
sum
hours
|p|
p
ticket_hours
project_id
|t|
tickets
project_id,
@project1
@project2
project=>@project1,
project=>@project2,
give
ticket
11
22
p1,
p2
p1
books
Book
one_to_one
first_page,
Page,
conditions=>
page_number=>1
page_number=>2
pages
Page
book
@page1
book=>@book1,
@page2
@page3
book=>@book2,
@page4
pages,
bk1,
bk2
books__id=>
1,2
first_page
bk1
graphable
once
second_page
Be
restart
modify
inflection
following
active
ActiveSupport
Inflector
inflections
|inflect|
inflect
plural
ox
$/i,
singular
en/i,
irregular
person
people
uncountable
fish
sheep
ViewSpecHelper
<div>This
text
ViewSpecHelper</div>
method_in_template_with_partial
method_in_partial
lib/recurring_event/expression
DateExpression
@condition
date
@rule
webrat/core/xml/nokogiri
namespace
newrelic
desc
Install
developer
yml
task
__FILE__,
install
/abstract_unit
test/unit
@node
Text
0,
hello,
howdy,
aloha,
annyeong
test_to_s
@node,
false,
/an+y/
/b/
/^howdy$/
howdy
assert_not_nil
NewRelic;
TEST
true;
NewRelic
NEWRELIC_ENABLE
ENV
RAILS_ENV
$LOAD_PATH
NEWRELIC_PLUGIN_DIR,
uniq!
environment
mocha
floor,
ceiling,
value,
floor
compare_metrics
actual_list
GC/cumulative
sort,
extra
missing
=begin
Enable
args,
puts
/#
@method_name
alias_method_chain
run,
info
=end
TransactionSampleTestHelper
make_sql_transaction
sampler
Agent
TransactionSampler
notice_first_scope_push
now
to_f
notice_transaction
/path
jim
cool
notice_push_scope
notice_sql
sleep
notice_pop_scope
notice_scope_empty
samples
plus
addend
_private,
last,
next,
prev,
doc,
RespondToController
ActionController
set_layout
html_xml_or_rss
respond_to
|type|
html
render
xml
XML
rss
RSS
Nothing
js_or_html
JS
json_or_yaml
YAML
html_or_xml
forced_xml
request
just_xml
using_defaults
using_defaults_with_type_list
html,
js,
made_for_content_type
atom
ATOM
custom_type_handling
application/crazy-xml
Crazy
Mime
register
text/x-mobile
mobile
Mobile
module_eval
remove_const
MOBILE
const_defined?
handle_any
Either
all_types_with_layout
iphone_with_html_response_type
register_alias
iphone
HTTP_ACCEPT
text/iphone
@type
Firefox
iPhone
IPHONE
iphone_with_html_response_type_without_layout
action
rescue_action
protected
action_name
view_paths
/fixtures/
@request
TestRequest
@response
TestResponse
@controller
www
assert_response
406
application/xml
text/javascript,
json_or_yaml,
text/yaml
application/json
body,
Hello
world!
text/javascript
$
visualEffect
highlight
<p>Hello
world!</p>\n
CONTENT_TYPE
application/atom+xml
application/rss+xml
application/javascript
text/xml,application/xml,application/xhtml+xml,text/html;q=0
9,text/plain;q=0
8,image/png,
;q=0
text/xml
RJS
<html><div
id=
>HTML
xhr
get,
html_xml_or_rss,
@action
@template
template_format
>Hello
future
Firefox!</div></html>
iPhone!</div></html>
assert_raises
MissingTemplate
AbstractPostController
testing
layouts
PostController
around_filter
with_iphone
index
SuperPostController
Super
models
systems
systems,
mq
memcache
models,
base
account
q
Cascade
tries
several
apps,
404
configurable
codes
apps
@apps
@catch
catch
ArgumentError,
cascade
|app|
app
break
alias_method
ostruct
GoogleChart
mixin
providing
solid,
linear
gradient
fills
Fills
FILL_KINDS
stripes
FILL_TYPES_SOLID
background,
transparent
FILL_TYPES
chart
FILL_TYPE_CODES
bg
SolidFill
color
GradientFill
angle,
colors,
offsets
StripesFill
widths
TODO
proper
docs
fill
@fills
Invalid
f=
create_fill
background
|k,v|
k
,v
validate_fill
parse_fill
add_fills
@params
solid
validate_solid
validate_gradient
validate_stripes
Must
angle
Numeric
#TODO
regex
colors
all?
between
is_numeric_array?
i>=0
i<=1
map_type
colors_offsets
zip
|item|
item
,#
colors_widths
lets
team
How
adds
matcher=nil
optional
Matcher
Matchers
When
+should+
receives
<tt>matches?
</tt>
+true+,
passes
execution
continues
+false+,
fails
<tt>matcher
Similarly,
+should_not+
matcher,
RSpec
ships
writing
own
matchers
details
fixtures/contact
FORMATS
xml,
@contact_attributes
aaron
stack
age
25,
avatar
binarydata
created_at
utc
2006,
8,
awesome
preferences
gem
Contact
@serialized
to_#
contact
from_#
age,
avatar,
awesome,
spec/spec_helper
ThinkingSphinx
toggle_delta
@beta
Beta
beta
stub_method
have_received
save!
suspended_delta
deltas_enabled?
Person
sphinx_indexes
delta_object
`
argument
deltas
disabled
deltas_enabled=
was
Exception
restore
deltas_enabled
no-op
even
there
exception
reindex
index_delta
should_not_receive
delta
@person
be_false
be_true
Configuration
true,
sphinx_running?
stub_methods
toggled
in_both_indexes?
sphinx_document_id
@client
Riddle
stub_instance
shouldn
indexing
updating
updates_enabled?
indexer
bin_path
--config
config_file
--rotate
core
Admin
companies,
finder_sql
net/https
benchmark
ActiveResource
ConnectionError
StandardError
@message
Failed
Redirection
to_s;
super;
ClientError
ConnectionError;
Bad
BadRequest
ClientError;
401
Unauthorized
UnauthorizedAccess
403
Forbidden
ForbiddenAccess
Not
Found
ResourceNotFound
409
Conflict
ResourceConflict
Server
ServerError
405
Method
Allowed
MethodNotAllowed
Allow
|verb|
verb
strip
remote
web
services
REST
Connection
site
requests
@@requests
+site+
URI
resource
service
site,
Formats
Missing
@site
parse
Execute
Used
resources
decode
build_request_headers
DELETE
HTTP
protocol
documentation
unfamiliar
delete,
PUT
put
put,
to_s,
POST
post,
Makes
logger
scheme
//#
port
Benchmark
realtime
-->
%
handle_response
Handles
422
600
Unknown
Creates
Net
communication
host,
use_ssl
HTTPS
verify_mode
OpenSSL
SSL
VERIFY_NONE
default_header
mime_type
Builds
authorization_header
authentication
information
pulled
credentials
provided
Basic
\r\n
SAX
Document
original_html
@doc_started
@document
document
@stack
@klass
kind_of?
DocumentFragment
start_element
characters
anchor
really
newline
implementation
choice
some
re
github
newline_index
@original_html
attrs
%r
^\s
<#
Regexp
comment
Comment
@document,
cdata_block
CDATA
end_element
pop
CoreExtensions
random
element
test/helper
Paperclip
Geometry
report
dimensions
@geo
1024,
768
width
768,
height
dimension
1024
WxH-formatted
800x600
800,
600,
xH-formatted
x600
Wx-formatted
800x
W-formatted
800
modifier
present
123x456
treat
@lower
@upper
123,
456,
@
^
|mod|
mod
preserved
123x456#
mod,
during
transformation_to
@src
@dst
123x456>
ImageMagick
formatting
5k
png
file,
from_file
Does
vertical
900,
1440,
horizontal
square
100,
|args|
performing
calculations
viewport
larger
smaller
aspect
assert_in_delta
0001
1000,
64,
64
1000
50,
25
sent
@scale,
@crop
transformation
geometry
@scale
attr_writer
@target
raise_unexpected_message_error
sym,
__raise
intro
unexpected
sym
arg_message
raise_unexpected_message_args_error
expectation,
expected_args
format_args
expectation
actual_args
raise_expectation_error
expected_received_count,
count_message
expected_received_count
out
raise_block_failed_error
detail
failed
raise_missing_block_error
args_to_yield
asked
|#
arg_list
raise_wrong_arity_error
arity
Mock
MockExpectationError,
|arg|
description
least
pretty_print
abs
Supported
create_items_table_with_column
column
cspecify
casting
sqlite,
number,
cast_string
generic
integer
number=>2
fixnum
Fixnum
Bignum
34
odbc,
mssql
Numeric,
size=>
15,
123456789
number=>BigDecimal
BigDecimal,
do,
jdbc,
today
dat
tim,
DateTime
tim
%Y%m%d%H%M%S
a\0
to_sequel_blob
be_a_kind_of
boolean
TrueClass
number=>true
FalseClass
#check
saved
@account2
BolideApi
Account
load_with
_id=>ACCOUNT
@account
api_key
queue
vhost
bolide
ACCOUNT
stats
MemCache
delivered_key
sent_key
concurrent_key
#accounts
accounts
async
after_request
|chunk|
check_q
chunk
set_headers
EventMachine
/q/#
Q1
#create
at_css
token
expire_on
msg_count
qs
EM
stop
<%=
class_name
Generator
NamedBase
manifest
|m|
lib
template
README
issue
warning
expected_warning
Called
`block
<module
allow_message_expectations_on_nil
disable
warn
negative
allowed
effect
subsequent
example_group
Example
ExampleGroupDouble
ran
sample
animals
pig
/helper
Repo
GRIT_REPO
@b
allocate
Git
any_instance
cat_file
fixture
cat_file_blob
@r,
11,
image/png
text/plain
blame
master
lib/grit
13,
|acc,
x|
acc
object_id,
__bake__
634396b2f541a9f2d58b00be1a07f0c358b999b3
Tom
Preston-Werner
tom@mojombo
1191997100
authored_date
committer
committed_date
initial
grit
test_inspect
%Q
#<Grit
test_basename
foo/bar
basename
autotest
rubygems
NO_RUBYGEMS
helper
will_paginate
WillPaginate
enable_activerecord
ActiveRecordTestCase
topics,
replies,
projects,
developers_projects
assert_respond_to_all
Topic,
per_page
paginate
paginate_by_sql
assert_queries
entries
Topic
page
current_page
total_pages
4,
required!
explicit
all,
still
Developer
10,
total_entries
5,
topics
ar
30
minutes
ago
replies
LIKE
Bird%
asc,
asc
entries,
THIS
fixed
Please
upgrade
newer
version
Nice%
AND
dhh
users
david
action_controller
expected_id_ordered,
implicit
topic
spam
witty_retort
reverse,
ASC
brave
joins
LEFT
JOIN
developer_id
developer_names
David
Jamis
salary
jamis
poor_jamis
Reply
100000
paginate_by_salary
100000,
finder
to_a,
with_poor_ones
named_scope
poor
developers
size,
found
total_entries,
recent
reply
misc
readonly
functionality
temporarily
removed
pager
include_method?
Is
Find
find_all
finders
accept
IDs
broken
uses_mocha
never
6,
DISTINCT
compatibility
ORDER
BY
999
999,
find_by_sql
count_by_sql
COUNT
sql\n
count_table
bar,
counts
wrong
defines
find_tagged_with
tag,
ids
query
QUERY
original_query
query,
collection
last_collection
params
14,
paginated_each
detect
private_methods
references_eager_loaded_tables?
first,
I
reproduce
failures
reports
Cucumber
feature
erb
steps
singular_name
_steps
gsub_file
features/support/paths
|match|
/the
new_#
NamedArg
banner
Usage
ModelName
field
be_a_kind_of,
be_kind_of
failure
kind
fail_with
matcher
matches?
rack/lobster
rack/mock
kind_of
look
like
MockRequest
ok
,,
,,,
flippable
provide
purposes
LocalEnvironment
responsible
determining
three
things
Framework
rails,
merb,
ruby,
external,
Dispatcher
dispatcher,
mongrel,
thin,
webrick,
etc
Instance
ID,
agents
dispatcher_instance_id
accessed
Control
singleton
dispatcher
possibly
distinguish
other,
may
framework
mongrel
instance,
one,
captured
convenience
processors
These
discover
dispatchers
constants
const_get
instance_of?
discover_framework
discover_dispatcher
@dispatcher
@gems
@plugins
@config
key/value
pair
settings
Block
raised
silently
ignored
append_environment_value
backtrace
@framework
@dispatcher_instance_id
Collect
comparison
detection
gather_environment_info
RUBY_VERSION
RUBY_DESCRIPTION
Java
VM
java
vm
OS
`uname
Arch
what
is,
works
linux
Processors
readlines
/proc/cpuinfo
Cannot
determine
readable?
current
Environment
Look
capistrano
indicating
revision
rev_file
root,
Revision
open
readline
configurations
Migrator
current_version
DataMapper
VERSION
Take
snapshot
Plugin
List
odd
necessary
around
bug
older
@mongrel
Mongrel
HttpServer
ObjectSpace
each_object
|mongrel|
!JRuby
runtime
is_object_space_enabled
unicorn
@unicorn
Unicorn
Obsolete
DelayedJob
instrumentation
support,
rpm_contrib
worker
$stderr
WARNING
moved
Although
NEWRELIC_DISPATCHER
advisable
implies
certain
api
passenger
torquebox
glassfish
thin
litespeed
webrick
fastcgi
sinatra
any?
shift
NEWRELIC_FRAMEWORK
Merb
Plugins
merb
Sinatra
external
sun
grizzly
DefaultRackApplicationFactory
org
OPTIONS
default_port
FCGI
covers
starting
mongrel_rails
started
Configurator
Still
Let
ARGV
fall
back
unlike
manages
threads
processes
recommend
upgrading
>=0
Thin
Same
assume
per
process
backend
way
uniquely
identify
sockets,
socket
!@dispatcher
caller
Passenger
optparse
nothing
found,
3000
OptionParser
|opts|
-p
--port=port
public
Overview
Resources
RESTful
resource,
basic
terms,
something
respond
representation
requested
In
terms
mean
browser
page,
desktop
design
assumption
four
verbs
GET,
POST,
PUT,
denotes
place
Different
Requests
saving
editing
occur
Editing
Examples
Posts
asking
/posts
particular
/posts/1
supplied
title
My
Whizzy
New
got
combine
updated
Changed
Title
By
our
routing
routes
Read
more
//en
wikipedia
Resource
member_methods,
new_methods
path_prefix,
name_prefix
plural,
entities,
@plural
@singular
singularize
arrange_actions
add_default_actions
set_prefixes
controller
requirements
with_id
@requirements
@id_requirement
^#
Routing
SEPARATORS
+/
@conditions
@path
path_prefix
new_path
/new
member_path
nesting_path_prefix
_id
nesting_name_prefix
_
action_separator
resource_action_separator
uncountable?
arrange_actions_by_methods
member
add_default_action
edit
actions
flipped_hash
collection,
unshift
SingletonResource
entity,
entity
pluralize
member_path,
nesting_path_prefix,
implementing
verb-oriented
controllers
messages
corresponding
MessagesController
messages_url
describing
message_url
edit_message_url
destroy
Along
themselves,
#resources
generates
views
<tt>map
produces
Named
Route
============
message_path
#url_for
redirect_to
link_to
%>
browsers
don
_method
tags
little
easier
form_tag
<%
form_for
message,
@message,
url
accepts
customize
resulting
<tt>
operate
Takes
</tt>,
delete</tt>
any</tt>
matter
URL
route
new</tt>
controller</tt>
recognition
sets
prefix
variables
comments
usually
belong
might
articles
comments,
article_id
nest
|article|
article
same,
article_comments_url
@article
article_comment_url
@article,
@comment
routes,
clash
tags,
nested
comments_url
comment_url
resources,
applied
messages,
/thread/
thread_id
maps
mark
/messages/1/mark
preview
/messages/new/preview
#preview
preview_new_message
any,
/messages/new
invoked
categories
category_id
restrictions
example,
RoutingError
rb</tt>
invalid
extract_options!
|entity|
map_resource
dup,
visiting
application,
/account
profile
<tt>projects</tt>
mapped
under
general
conventions
taken
There
No
nesting
AccountsController
account_url
map_singleton_resource
with_options
|map|
map_collection_actions
map,
map_default_collection_actions
map_new_actions
map_member_actions
map_associations
nesting_name_prefix,
map_default_singleton_actions
|association|
association,
name_prefix,
|method,
actions|
|action|
action_options
action_options_for
named_route
formatted_#
index_action_options
index_route_name
_index
create_action_options
new_path,
formatted_new_#
_new_#
show_action_options
update_action_options
destroy_action_options
add_conditions_for
conditions,
|options|
default_options
require_id
RouteSet
Mapper
content,
xmlBufferFree
webrat/core/locators/locator
Webrat
Locators
LinkLocator
Locator
locate
Link
@session,
link_element
matching_links
min
|a,
b|
all_inner_text
<=>
link_elements
matches_text?
matches_id?
link
/i
replace_nbsp
replace_nbsp_ref
inner_html
link,
xpath_search
@dom,
U
&nbsp;
error_message
Could
text_or_title_or_id
dom,
locate!
@env
to_stdout
~
STDOUT
init_config
add_rakefiles
newrelic_root,
gives
feel
stuff
piece
Selenium
ApplicationServer
system
start_command
silence_stream
pid
pid_file
kill
-9
rm_f
==>
boot
exiting!
Verify
application_port
command
exit
merb_command
-d
-e
exist?
bin/merb
merb_cmd
serves
given,
according
Handlers
bodies
File,
+path+
to_path
@root
_call
F
@path_info
unescape
PATH_INFO
forbidden
file?
serving
SystemCallError
not_found
403,
size?
whether
stat
g
/proc
often
figure
reading
whole
And
Last-Modified
mtime
extname
404,
@path,
8192
###
Slop
implements
XPath
CSS
+name+
method_missing
css
conds
Parser
xpath_for
UI
Console
started_with_rspec
@need_to_output_started
test_started_with_rspec
@rspec_io
Started
test_finished_with_rspec
@ran_test
finished
finished_with_rspec
elapsed_time
finished,
setup_mediator_with_rspec
orig_io
Sanitizer
sanitize
text,
sanitizeable?
tokenize
!text
tokenizer
Tokenizer
token,
process_node
result,
FullSanitizer
ie
too
gsub!
Recurse
dirty
LinkSanitizer
cattr_accessor
instance_writer
included_tags
<href
Tag
WhiteListSanitizer
shorthand_css_properties
|attr|
class_inheritable_accessor
attr,
regular
protocols
//foo
protocol_separator
&#0
58
&#x70
%|&#37;
3A/
Specifies
URIs
uri_attributes
src
cite
longdesc
lowsrc
#sanitize
completely,
opposed
escaping
bad_tags
script
allowed_tags
strong
em
pre
tt
kbd
var
sub
sup
dfn
big
small
address
hr
br
div
span
h1
h2
h3
h4
h5
h6
ul
ol
li
dt
dd
abbr
acronym
img
blockquote
del
ins
leave
tag
allowed_attributes
alt
lang
acceptable
properties
#sanitize_css
allowed_protocols
ftp
https
mailto
news
gopher
feed
svn
urn
aim
ssh
keywords
allowed_css_properties
background-color
border-bottom-color
border-collapse
border-color
border-left-color
border-right-color
border-top-color
cursor
direction
display
font
font-family
font-size
font-style
font-variant
font-weight
letter-spacing
line-height
overflow
pause
speak
text-align
text-decoration
text-indent
vertical-align
white-space
allowed_css_keywords
black
blue
bold
both
bottom
brown
center
collapse
dashed
dotted
green
italic
medium
normal
nowrap
red
top
white
yellow
shorthand
border
margin
padding
Sanitizes
comes
across
style
sanitize_css
urls
\s
/,
!~
\s\w
+\
|\
-\w
clean
prop
keyword
0-9a-f
0,2
?\d
closing
process_attributes_for
&lt;
|attr_name|
attr_name
!options
contains_bad_protocols?
attr_name,
CGI
escapeHTML
^\/
BusyCalculator
@instance_busy
MethodTraceStats
instance_busy_stats
timewindow
seconds
seconds,
harvest_start
dispatcher_start
dispatcher_finish
accumulator
harvest_busy
call_count
total_call_time,
05
call_count,
test_reentrancy
complete
calls,
Thread
busy
9,
90,
025
Problem
off
zero
InMemoryMemCache
raw
expire
incr
decr
new_relic/agent/instrumentation/controller_instrumentation
Instrumentation
Relic
instrument
#call
collecting
transaction
traces
middleware
identified
middleware,
ControllerInstrumentation
ClassMethods#add_transaction_tracer
newrelic_rpm
new_relic/agent/instrumentation/rack
Middleware
Metal
MetalApp
Overriding
metric
omit
follow
add_transaction_tracer
call,
category
rack,
chained
Calls
transactions
instrumented
frameworks
cases,
Here
perform_action_with_newrelic_trace
newrelic_request_headers
@newrelic_request
call_with_newrelic
call_without_newrelic
Ignore
cascaded
MetricFrame
abort_transaction!
stored
MetricParser
short_name
segments
Average
Queue
legend_name
Wait
httpdate
Deflater
@app
Skip
responses
no-transform
STATUS_WITH_NO_ENTITY_BODY
Cache-Control
select_best_encoding
gzip
deflate
accept_encoding
Vary
vary
Accept-Encoding
push
Content-Encoding
key?
GzipStream
DeflateStream
fullpath
@mtime
DEFLATE_ARGS
drop
causes
Safari
IE
choke
deflater
Deflate
TEST_TYPES
Units
tests
pairs
@pairs
@statistics
calculate_statistics
@total
calculate_total
print_header
|pair|
print_line
print_splitter
Total
print_code_test_stats
pair|
calculate_directory_statistics
directory,
pattern
rb$/
lines
codelines
foreach
|file_name|
file_name
directory?
/^\
newstats
file_name,
|k,
v|
a-z
/^\s
#/
total
each_value
calculate_code
code_loc
calculate_tests
test_loc
Lines
LOC
Classes
m_over_c
loc_over_m
20
rjust
Code
1f
PieChart
@pie
chart_type
label
color,true
p3
is_3d
is_3d?
show_labels
show_labels?
Series
40
query_params
chd
0,100
chl
non
contains
grab-bag
applications
adopted
kinds
libraries
Performs
construct
faster
rather
than
Stolen
Camping
/n
H2
tr
module_function
escaped
0-9a-fA-F
H
Mongrel,
modifications
Parses
breaking
cookies
changing
&;
parse_query
qs,
k,
cur
cur,
parse_nested_query
normalize_params
params,
^\
param
child_key
!params
child_key,
after,
build_query
Escape
brackets
HTML/XML
escape_html
&amp;
&gt;
&quot;
//www
w3
expanded_accept_encoding
|m,
q|
available_encodings
_|
m2
m,
|mem,
mem
encoding_candidates
|_,
-q
String;
Context
compatible
different
handling
#context
would
forwarded
app_f,
app_r
@for,
@for
env,
recontext
case-insensitive
preserves
hash=
@names
to_hash
|hash,
k,v
to_ary
has_key?
Every
appropriate
HTTP_STATUS_CODES
Continue
101
201
Created
203
Information
204
Content
205
Reset
Partial
Multiple
301
Moved
Permanently
302
Modified
Redirect
Required
Authentication
Timeout
Length
Entity
Too
Large
414
Unsupported
Range
Internal
501
Implemented
Gateway
503
Service
504
Version
multipart
parser,
adapted
Usually,
takes
care
Multipart
EOL
parse_multipart
;,
boundary
--#
buf
CONTENT_LENGTH
boundary_size
bufsize
16384
-=
read_buffer
EOFError,
rx
?#
|--
head
filename
slice!
First
/Content-Disposition
filename=
?/ni,
/ni,
binmode
Save
boundary_size+4
rest
-1
blank
means
selected
upload
handles
full
Windows
paths
Internet
Explorer
perhaps
affecting
/m
filename,
content_type,
Generic
receive
loggers
4,3
ConnectionPool
max_size
cc
1234
respect
single_threaded
single_threaded=>true
SingleConnectionPool
single_threaded=>
identifier_input_method=>nil
identifier_input_method=>
identifier_output_method=>nil
identifier_output_method=>
quote_identifiers_default;
identifier_input_method_default;
camelize
identifier_output_method_default;
jdbc
adapter_class
//host/db_name
disconnect
extension
attempt
blah
NotImplemented
@o
logs;
@logs
args;
logger=>@o
log_info
logs
info,
blah;
duration
/\A\
\d\
\d
s\
blah\z/
greater
log_warn_duration
less
adsf
2\
\z/
mau
//user
pass@localhost
9876/maumau
aliased
#url
adapter_scheme
Database#dataset
@ds
#from
miu
sql_number
#select
a,
b,
Database#execute
Database#tables
indexes
@sqls
define_method
|sql,
opts|
clear;
sql;
concat
items2
server=>
s1
12345
wrap
hold
c1,
c2
t1
c1
c;
!stop;sleep
t2
available_connections
@test
test_connection
successful
attempting
DummyDataset
DummyDatabase
transaction;
yield;
create_table
integer,
NOT
PRIMARY
KEY
AUTOINCREMENT,
UNIQUE
INDEX
test_name_index
test_tmp,
temp
test_tmp
test_tmp_name_index
alter_table
xyz
aaa,
drop_column
bbb
rename_column
ccc,
ddd
set_column_type
eee,
set_column_default
hhh,
abcd
fff,
drop_index
ggg
ALTER
ADD
COLUMN
aaa
RENAME
ccc
TO
TYPE
hhh
DEFAULT
zyx
@sql
bb,
bb
rename_table
try
db2
Dummy3Database
DummyConnection
Database#transaction
COMMIT
test;
committing
ret_commit
test2;
ROLLBACK
raised,
re-raise
RuntimeError
Rollback
commiting
DatabaseError
meta_def
commit_transaction
re-entrant
1;
savepoints
supports_savepoints?
savepoint
savepoint=>true
SAVEPOINT
autopoint_1
RELEASE
progress
reuse
CCC
DISCONNECTS
registered
ADAPTER_MAP
instantiated
//localhost/db
localhost
accessible
z
returnValue
&p
y,
def_adapter_method,
host=>
z,
mydb
delete_if
disconnection_proc
adapter=>
/tmp
parts
truthy
DatabaseConnectionError
///d%5bb%5d
test=>
unknown
AdapterNotFound
@fn
threaded
constructable
1234567
invoke
connection_proc
1234568
@dc
dc
servers=>
single_threaded?
be_single_threaded
max_options
s,
15
aman
y=>
r|
r;
select_sql
filter!
Database#
symbols
create_view
VIEW
identifier,
qualify
sch
create_or_replace_view
drop_view
op
//blahblah/blah
sql_function
MockDatabase
select_all
n=>
$n
select_n
select_n,
n=>1
servers
host=>1,
server_opts,
server1
entry
database=>2,
merged
server1=>
host=>3
|db|
host=>4
server2
add_servers
server2=>
existing
remove_servers
server1,
removal
|c1|
|c2|
|c3|
c3
|c4|
c4
c5
hosts
each_server
DATABASES
dbs
dcs
reraise
raise_error,
classes=>
Interrupt
DatabaseDisconnectError
InvalidValue
typecast_value
float,
e2
decimal,
date,
time,
datetime,
wrapped_exception
considered
value|
blank_object?,
empty?,
blank?,
parsed
indicates
schema_autoincrementing_primary_key?
primary_key=>true
primary_key=>false
input_identifier_meth
output_identifier_meth
metadata_dataset
converting
many
\\a
2009-10-29
2009,10,29
CURRENT_TIMESTAMP
2009-10-29T10
30-07
00
NaN
character
varying
bytea
241343
mysql
CURRENT_DATE
enum
-12
paginated
@d
153
@paginated
page_count
next_page
prev_page
page_range
current_page_record_range
151
current_page_record_count
know
last_page?
first_page?
150
LIMIT
OFFSET
each_page
iterate
resultset
tactical_eager_loading
retrieved
currently
cached,
assumes
Tactical
affect
Dataset#all,
Basically,
queries
Album
id<100
artists
tactical
InstanceMethods
reteived
Dataset#all
retrieved_by
All
retrieved_with
cache
opts,
|o|
rack/file
rack/lint
DOCROOT
/cgi/test
/ruby/
DOCROOT,
encoded
filenames
/cgi/%74%65%73%74
traversal
/cgi/
/test
periods
404s
/cgi/blubb
detects
env_for
@matz
Matz
to_xml
@matz_deep
@matz_array
Ryan
@addy
street
Street
@addy_deep
27519
@default_request_headers
HttpMock
|mock|
/people/1
xml?name=Matz
/people/managers
/people/1/promote
xml?by=name
/people/1/deactivate
/people/new/register
@ryan,
/people/5
@matz,
/people/1/addresses/1
/people/1/addresses/2
reset!
retrieve,
promote,
Nested
StreetAddress
person_id
against
shallow
deep
position
Manager
deactivate
With
ryan
addy
Dr
matz
managers
associate
another
owner,
owner
building
Hash,
attribute,
GeneratedAttribute
default_value
99
timestamp,
belongs_to,
references
name_or_reference
STRING
thread
Session
Pool
session_key
DEFAULT_OPTIONS
session_match
+;/
incrementor
session
counter
drop_session
renew_session
renew
defer_session
defer
=>1
determines
HTTP_COOKIE
=>2
=>3
survives
deletes
pool,
dreq
res0
res1
res2
res3
rreq
new_cookie
new_session
=>4
omits
anyone
better?
multithread
sessions
$DEBUG
Running
sess_id
^,;
/,1
delta_incrementor
emulate
disconjoinment
threading
usec
tses
treq
tnum
to_i+5
|run|
cookie,
|res|
tnum+1
meeeh
vendor/metaid
year
in_#
args|
range_each_#
month_number
|date|
month_range
spec/runner/formatter/base_text_formatter
Formatter
SpecdocFormatter
BaseTextFormatter
example_group_started
flush
example_failed
counter,
FAILED
example_passed
example_pending
deprecated_pending_location=nil
PENDING
meta_class
self;
to_json
rack/content_length
app,
Host
8080
replacing
URLMap
|path,
+path
?/
appl
!=
ContentLength
request,
HTTP_CONTENT_TYPE
HTTP_CONTENT_LENGTH
SCRIPT_NAME
0,1
$stderr,
multiprocess
???
run_once
url_scheme
vs|
vs
Provides
alternate
syntaxes
factory_girl
syntax
factories,
Syntax
Blueprint
Machinist
Generate
usage
Facade
specs
connecting
DRB
DrbCommandLine
Runs
API
CommandLine
ruby-lang
why
DRb
start_service
druby
//localhost
spec_server
//127
8989
argv,
output_stream
error_stream
Adds
easy
Atom
Builder
engine
ERb
languages
ActionView
Full
config/routes
Routes
draw
PostsController
ApplicationController
@posts
|format|
builder
atom_feed
|feed|
great
blog!
|entry|
|author|
DHH
Defaults
en-US
alternative
url</tt>
yields
AtomFeedBuilder
eval
instruct!
language
xmlns
request_uri
rel
root_url
host_with_port
view
@xml,
@view
Accepts
inserts
passed,
date_or_time
@xml
xmlschema
published
updated_at
polymorphic_url
record,
__send__
Object;
const_available?,
const_defined?;
ContentController
route_one
flash_me
controller/
action/
fileutils
req_gem
Rakefile
RubyGem
Installation
-y
BeforeAndAfterHooks
before_suite_parts
after_suite_parts
Registers
executed
all</tt>,
append_before
scope
each,
before_parts
before,
prepends
+block+
blocks
<tt>append_before</tt>
scoping
semantics
prepend_before
prepend_after
after_parts
appends
append_after
before_each_parts
@before_each_parts
after_each_parts
@after_each_parts
before_all_parts
@before_all_parts
after_all_parts
@after_all_parts
each;
all;
suite;
failing
RedirectTo
StatusCodes
@expected
response_or_controller
@redirected
redirect?
@actual
redirect_url
@expected_status
@actual_status
interpret_status
@status_matched
^\w+
actual_redirect_to_valid_route
actual_hash
expected_hash
expected_url
hash_from_url
query_hash
path_hash
with_indifferent_access
recognize_path
UrlRewriter
@request,
rewrite
HTTP_REFERER
failure_message_for_should
failure_message_for_should_not
redirected
call-seq
controller_name,
Passes
url,
controller/action
Useful
integration
isolation
//test
a-zA-Z_
$1,
Couldn
fixtures/topic
fixtures/reply
fixtures/person
fixtures/developer
condition_is_true
condition_is_true_but_its_not
ProtectedPerson
set_table_name
addon
attr_protected
UniqueReply
validates_uniqueness_of
PlagiarizedReply
validates_acceptance_of
author_name
dependent
destroy,
Wizard
abstract_class
IneptWizard
city
Conjurer
Thaumaturgist
write_inheritable_attribute
validate,
validate_on_create,
validate_on_update,
content!
!r
valid?,
saveable
valid?
invalid?
Empty
contain
Wrong
save,
Update
RecordInvalid
create!
r,
with_scope
Mary
first_name,
ignore
|attr,
Mismatch
each_full
|error|
dignifying
on_base
hits
validates_each
title,
gotcha
whatever
!t
validates_confirmation_of
title_confirmation
Parallel
Lives
confirmed
terms_of_service,
terms_of_service
accepted
abided
eula
agree
Dan
Brown
const_set
StatementInvalid
validates_presence_of
unique!
Remaining
!t2
Shouldn
Now
r1
Saving
r2
!r2
r3
me
barrel
fun
succeed
applies
author_name,
author_email_address,
actually
jeremy
author_email_address
jeremy@rubyonrails
crazy!
again
Double
jeremy_alt_email@rubyonrails
!r3
third
allow_nil
UNIQUE!
w1
Rincewind
validation
abstract
w2
Quirm
uniqueness
w4
Amazing
Bonko
w5
w6
validates_format_of
Validation
rule!
0-9
$/,
03
validates_inclusion_of
!Topic
a!
am
uhoh
allow_nil=>true
validates_numericality_of
michael
salary;
read_attribute
100000;
validates_length_of
ab
abcde
allow_blank=>true
%s
salary,
validates_exclusion_of
abe
monkey
restricted
minimum
short
maximum
notvalid
too_long
%d
few
iamfine
too_short
bigmin
bigmax
32
bigrange
tu
est
trops
petit
hombre
validates_size_of
maximum=>9
within=>6,
minimum=>5,
message=>
boo
too_short=>
hoo
maximum=>5,
uhohuhoh
too_long=>
is=>5,
kcode_scope
kcode
orig_kcode
$KCODE
UTF8
一二三四五
一二三
長すぎます
一二三四五六七八九十A
短すぎます
一二345
あいうえお
かきくけこ
validates_associated
Another
non-empty
Yet
r4
validated
ActiveRecordError
100,000
!d
double\
confirm
John
name_confirmation
Johnny
Joe
non_existent
topic,
evaluated
binding,
important
Just
J
NIL
BLANK
\t
\r
BIGDECIMAL_STRINGS
12345678901234567890
1234567890
significent
digits
FLOAT_STRINGS
+0
-0
-10
-090
90
-90
INTEGER_STRINGS
FLOATS
INTEGERS
BIGDECIMAL
collect!
bd
JUNK
approved
invalid!
valid!
approved,
only_integer
greater_than
-10,
-9,
less_than
-2,
-1,
values,
error=nil
with_each_topic_approved_value
|topic,
!topic
rejected
error,
|value|
controller_path
capture
@content_for_#
<<-WARNING
DEPRECATION
NOTICE
rspec-rails
deprecated
working
Section
settings_body
|setting|
conf
setting_to_array
|set|
flatten
CgiExt
Stdinput
escapeHTML_fail_on_nil
/lib
active_resource
setter_trap
Logger
options=nil
serve
$stdin
yes
HTTP_VERSION
SERVER_PROTOCOL
REQUEST_PATH
send_headers
send_body
print
Status
dot_git
is_bare
@tags
list_from_string
not_annotated
ca8a30f5a7f0f163bbe3b6f0abf18a6c83b0687a
commit
v0
7bcc0ee821cdd133d8a53e8e7173a334fef448aa
annotated
packed
packed_annotated
recent_tag_name
3fa4e130fa18c92e3030d4accb5d3e0cadd40157
boom
git
library
converted
commands
Scott
Chacon
tagger
schacon@gmail
2008,
18,
23,
27,
tag_date
Chris
2009,
22,
16
Grit
Thu
Jan
1970
TAG
32,
29
XmlXpathContextMixin
XmlNode
doc
XmlDocumentCast
xmlXPathFreeContext
XmlXpathContextCast
edge
graph
Edge
source,
Vertex
sink,
daemonize
fork
Parent
exits,
Process
setsid
Become
leader
Zap
Release
old
umask
0000
Ensure
sensible
Adjust
needed
STDIN
reopen
/dev/null
Free
descriptors
somewhere
STDERR
STDOUT/ERR
better
logfile
interval
RAILS_ROOT
daemon
spinner
separator
<<-EOF
Description
protection
exited
outright
ll
spawner
every
light
attempts
terminal
-i
detach
-c
9000
EOF
-h
--help
Show
help
opts;
parse!
trap
TERM
INT
cucumber/formatter/ansicolor
ANSIColor
to_proc
format_step
keyword,
step_match,
source_indent
step_match
file_colon_line
indent
format_string
c,
format_for
line,
fmt
print_elements
step_mother
elements,
elements
each_with_index
|element,
i|
print_exception
exception,
dump_count
scenarios
scenario
failed,
skipped,
undefined,
pending,
|status|
step
e,
strict
Undefined
nested?
\n#
snippets
|step|
step_name
step_multiline_class
multiline_arg
snippet
@step_mother
snippet_text
step_name,
uniq
\nYou
implement
\n\n
announce
announcement
count,
what,
state,
@mock
higher
random_call
rspec_reset
unspecified
RenderMailer
ActionMailer
recipient
recipients
subject
tester@example
inline
Hello,
@world
Earth
rendering
Including
rendered
method_name
FirstMailer
share
SecondMailer
set_delivery_method
perform_deliveries
deliveries
@recipient
test@localhost
restore_delivery_method
mail
<?xml
version=\
0\
encoding=\
UTF-8\
ActionViewError
create_share
unicorn_rails
-E
rails_env
workers
worker_processes
Load
rails+github
forking
super-fast
spawn
preload_app
GC
Restart
haven
responded
timeout
Listen
Unix
stderr_path
/u/apps/bolide/current/feature_app/log/unicorn
stderr
stdout_path
stdout
working_directory
monthly
/u/apps/bolide/current/feature_app/tmp/pids/unicorn
listen
sock
backlog
2048
before_fork
|server,
worker|
disconnect!
USR2,
suffix
pidfile
oldbin
immediately
itself
completely
spawning
spawned
so,
booted
tell
die
QUIT
Using
downtime
deploys
old_pid
exists?
ENOENT,
ESRCH
someone
did
job
us
after_fork
loads
forks
works,
aren
establish_connection
fine,
uid,
gid
euid,
egid
www-data
target_uid
Etc
getpwnam
uid
target_gid
getgrnam
chown
target_uid,
initgroups
GID
change_privilege
UID
development
couldn
oh
well
Joke
funny_jokes
Namespace
ViewExampleGroupController
RenderObserver
template_path
add_helper
helper_module
_helper
forget_variables_added_to_assigns
View
live
Specs
invoking
login/login
login
have_tag
action=/login
with_tag
type=text
name=email
type=password
type=submit
ViewExampleGroup
FunctionalExampleGroup
|name|
Helper
helper_modules
inherited
ensure_that_flash_and_session_work_properly
ensure_that_base_view_path_is_not_set_across_example_groups
public,
flash
@session
base_view_path
set_base_view_path
derived_controller_name
subject_of_render
-2
derived_action_name
template,
partial,
render_type
add_helpers
Renders
Also
inline,
helpers,
/people/list
partial
|k|
description_parts
/^\//,
assigns
path_parameters
reverse_merge!
controller_name
render,
dealing
partials
/person/new
ExampleGroupFactory
view,
_assigns_hash_proxy
@_assigns_hash_proxy
AssignsHashProxy
tmail
encrypted_password,
HTTPServlet
AbstractServlet
HTTPServer
mount
WEBrick,
shutdown
server,
req,
meta_vars
n,
set-cookie
Provide
BenchmarkedController
public_action
MockLogger
SQLITE_DB
SQLITE_URL
auto_vacuum
pragma
pragma_get
pragma_set
auto_vacuum,
incremental
sqlite_version
foreign_keys
30619
enforce
foreign
integrity
fk
id;
unset
id=>1,
synchronous
temp_store
t;
t1,
iso8601
t2,
sequential
with_pk
reload=>true
t,
allow_null=>true,
default=>nil,
ruby_default=>nil,
db_type=>
matches
ilike
regexp
/a/
/a/i
d=>BigDecimal
80
Infinity
-Infinity
c___a
join_table
natural,
j,
NATURAL
j
Dataset#delete
56
89
affected
unfiltered
Dataset#update
xxx
#explain
explain
modified
test2
operations
test2,
xyz,
mmm
111,
xyz=>
000
keep
dropping
test3
lame
additions
deletions
messed
recreate
test3,
table_info
qqqq
preserve
renaming
default=>
quoted
table_name
T
=>1,
table_name,
choose
isn
test3_backup0
test3_backup1
h,
/\ACREATE
test3_backup
01
test3_backup2
l
012
test_new
ParseOptions
|constant|
constant
STRICT
recover
noent
strict?
class-level
@normal_reflection
Reflection
AssociationReflection
polymorphic
@normal_association
@poly_reflection
macro
has_many,
polly
@non_poly_reflection
reflect_on_association
@normal_association,
polymorphic_classes
Person,
casted_options
casted
assoc
assocation
@reflection
@association
klass,
assoc,
join_to
@parent_join
ClassMethods
JoinDependency
JoinAssociation
@join
@base_join
@assoc
@parent,
ref
to_sql
aliased_table_name
NAME
association_join
ts_join_alias
gone
is_many?
parent_is_many
habtm
has_and_belongs_to_many
parents
person_type
Friendship
foreign_type
thing_id
thing_type
casted_options,
`thing_type`
append
Property
alias,
columns,
associations,
model,
admin
Maybe
reserved
fix
bare
|column|
__stack
@alias
@faceted
facet
Else
probably
won
Consider
yourself
unique_name
__name
Facet
GROUP
not,
latter
happen
from,
use_group_by_shortcut?
column_with_prefix
is_string?
|col|
col
_changed?
admin?
|assoc|
@model
quote_with_table
quote_table_name
quote_column
quote_column_name
concatenated
space
True
sources
